app/Http/Controllers/Auth/LoginController.php

    public function Userlogin(Request $request)
    {
        // Validate the input
        $request->validate([
            'content' => 'required', // Either email or phone number
            'password' => 'required', // Password is required
        ]);
        $content = $request->content;
        $password = $request->password;
        // Check if content is an email or phone
        $validData = User::where('email', $content)->orWhere('mobile', $content)->first();
---
select * from `users` where `email` = '01842299275' or `mobile` = '01842299275' limit 1

    public function Adminlogin(Request $request)
    {
        // Validate the input
        $request->validate([
            'content' => 'required', // Either email or phone number
            'password' => 'required', // Password is required
        ]);
        $content = $request->content;
        $password = $request->password;
        // Check if content is an email or phone
        $validData = User::where('email', $content)->orWhere('mobile', $content)->first();
---
select * from `users` where `email` = 'admin@gmail.com' or `mobile` = 'admin@gmail.com' limit 1