app/Http/Controllers/Frontend/CheckoutController.php

select * from `logos` limit 1
select * from `contacts` limit 1
---
    public function customerLogin()
    {
        if (auth()->user()) {
            if (auth()->user()->usertype === 'customer') {
                return redirect()->route('kafi');
            }
            if (auth()->user()->usertype === 'vendor') {
                return redirect()->route('seller.dashboard');
            }
            if (auth()->user()->usertype === 'seller') {
                return redirect()->route('seller.dashboard');
            }
        }
        $data['logo'] = Logo::first();
        $data['contact'] = Contact::first();

select * from `logos` limit 1
select * from `contacts` limit 1
---
    public function customerSignup()
    {
        if (auth()->user()) {
            if (auth()->user()->usertype === 'customer') {
                return redirect()->route('kafi');
            }
            if (auth()->user()->usertype === 'vendor') {
                return redirect()->route('seller.dashboard');
            }
            if (auth()->user()->usertype === 'seller') {
                return redirect()->route('seller.dashboard');
            }
        }
        $data['logo'] = Logo::first();
        $data['contact'] = Contact::first();