app/Http/Controllers/Frontend/DashboardController.php

select * from `logos` limit 1
select * from `contacts` limit 1
select `category_id` from `products` group by `category_id`
select * from `orders` where `user_id` = 25 order by `id` desc
---
    public function orderList()
    {
        $data['logo'] = Logo::first();
        $data['contact'] = Contact::first();
        $data['categories'] = Product::select('category_id')->groupBy('category_id')->get();
        $data['orders'] = Order::where('user_id', Auth::user()->id)
            ->orderBy('id', 'DESC')
            ->get();