app/Http/Controllers/Frontend/FrontendController.php

    public function index()
    {

        $data['hot_deals'] = Product::where('hot_deals', 1)->where('status', 1)->orderBy('id', 'DESC')->get();
        $data['featureds'] = Product::where('featured', 1)->where('status', 1)->orderBy('id', 'DESC')->get();
        $data['special_offers'] = Product::where('special_offer', 1)->where('status', 1)->orderBy('id', 'DESC')->get();
        $data['special_deals'] = Product::where('special_deals', 1)->where('status', 1)->orderBy('id', 'DESC')->get();

        // Sliders
        $data['sliders'] = Slider::select('id', 'name', 'image')->orderBy('id', 'desc')->get();

        // Latest products
        $data['allData'] = Product::select('id', 'status', 'category_id', 'brand_id', 'name', 'slug', 'country_id', 'price', 'discount_type', 'discount', 'image')->where('status', 1)->orderBy('id', 'DESC')->get();

        // Categories with active products
        $categories = DB::table('categories')->select('categories.id', 'categories.name', 'categories.name_bn')->join('products', 'products.category_id', '=', 'categories.id')->where('products.status', 1)->groupBy('categories.id', 'categories.name', 'categories.name_bn')->orderBy('categories.id', 'DESC')->get();

        // Top selling products
        $top_sales = DB::table('products')->leftJoin('order_details', 'products.id', '=', 'order_details.product_id')->selectRaw('products.id, SUM(order_details.quantity) as total')->where('status', 1)->groupBy('products.id')->orderBy('total', 'desc')->get();

        $topProducts = [];
        foreach ($top_sales as $s) {
            $p = Product::findOrFail($s->id);
---
select * from `products` where `hot_deals` = 1 and `status` = 1 order by `id` desc
select * from `products` where `featured` = 1 and `status` = 1 order by `id` desc
select * from `products` where `special_offer` = 1 and `status` = 1 order by `id` desc
select * from `products` where `special_deals` = 1 and `status` = 1 order by `id` desc
select `id`, `name`, `image` from `sliders` order by `id` desc
select `id`, `status`, `category_id`, `brand_id`, `name`, `slug`, `country_id`, `price`, `discount_type`, `discount`, `image` from `products` where `status` = 1 order by `id` desc
select `categories`.`id`, `categories`.`name`, `categories`.`name_bn` from `categories` inner join `products` on `products`.`category_id` = `categories`.`id` where `products`.`status` = 1 group by `categories`.`id`, `categories`.`name`, `categories`.`name_bn` order by `categories`.`id` desc
select products.id, SUM(order_details.quantity) as total from `products` left join `order_details` on `products`.`id` = `order_details`.`product_id` where `status` = 1 group by `products`.`id` order by `total` desc
select * from `products` where `products`.`id` = 43 limit 1

        $categoryproducts = [];

        foreach ($categories as $category) {
            $products = DB::table('products')->select(
                'id',
                'name',
                'name_bn',
                'slug',
                'image',
                'price',
                'discount',
                'discount_type',
                'category_id',
                'status'
            )
                ->where('status', 1)
                ->where('category_id', $category->id)
                ->orderBy('id', 'DESC')->take(50)->get();
---
select `id`, `name`, `name_bn`, `slug`, `image`, `price`, `discount`, `discount_type`, `category_id`, `status` from `products` where `status` = 1 and `category_id` = 17 order by `id` desc limit 50

    public function categoryWiseProduct($category_id)
    {
        $data['category'] = Category::where('id', $category_id)->first();
        $data['products'] = Product::where('category_id', $category_id)->where('status', 1)->orderBy('id', 'DESC')->paginate(20);
---
select * from `categories` where `id` = '17' limit 1
select count(*) as aggregate from `products` where `category_id` = '17' and `status` = 1

    public function productDetails($slug)
    {
        //dd($slug);
        $data['hot_deals'] = Product::where('hot_deals', 1)->where('status', 1)->orderBy('id', 'DESC')->get();
        $data['categories'] = Product::select('category_id')->groupBy('category_id')->get();
        $data['productDetails'] = Product::with([
            'product_colors.color',
            'product_sizes.size',
            'activeVariants.color',
            'activeVariants.size'
        ])->where('slug', $slug)->first();
        $brand_id = $data['productDetails']->brand_id;
        $data['relatedProduct'] = Product::where('brand_id', $brand_id)->inRandomOrder()->get();
        $data['product_sub_image'] = ProductSubImage::where('product_id', $data['productDetails']->id)->get();
        $data['product_color'] = ProductColor::where('product_id', $data['productDetails']->id)->get();
        $data['product_size'] = ProductSize::where('product_id', $data['productDetails']->id)->get();

        // Product variants data
        $data['product_variants'] = ProductVariant::where('product_id', $data['productDetails']->id)->get();
---
select * from `products` where `hot_deals` = 1 and `status` = 1 order by `id` desc
select `category_id` from `products` group by `category_id`
select * from `products` where `slug` = 't-shirtfd530deb-2367-4b4f-9c5e-f38256' limit 1
select * from `products` where `brand_id` = '1' order by RAND()
select * from `product_sub_images` where `product_id` = 4
select * from `product_colors` where `product_id` = 4
select * from `product_sizes` where `product_id` = 4
select * from `product_variants` where `product_id` = 4

    public function getPrice(Request $request)
    {

        $request->validate([
            'product_id' => 'required|integer|exists:products,id',
            'color_id' => 'nullable|integer',
            'size_id' => 'nullable|integer',
        ]);


        $product = Product::findOrFail($request->product_id);


        $variantQuery = ProductVariant::where('product_id', $product->id);

        if ($request->filled('color_id')) {
            $color = ProductColor::find($request->color_id);
            if ($color) {
                $variantQuery->where('color_id', $color->color_id);
            }
        }

        if ($request->filled('size_id')) {
            $size = ProductSize::find($request->size_id);
            if ($size) {
                $variantQuery->where('size_id', $size->size_id);
            }
        }

        $variant = $variantQuery->first();
---
select * from `products` where `products`.`id` = '30' limit 1
select * from `product_colors` where `product_colors`.`id` = '100' limit 1
select * from `product_sizes` where `product_sizes`.`id` = '132' limit 1
select * from `product_variants` where `product_id` = 41 and `color_id` = '5' and `size_id` = '3' limit 1
select * from `product_variants` where `product_id` = 30 and `color_id` = 1 limit 1