app/Http/Controllers/AddToCartController.php

    public function customerCartData()
    {
        $cookie_id = request()->cookie('customer_cookie_id');

        $cartItems = Cart::with([
            'product',
            'product_color.color',
            'product_size.size',
        ])->where('cookie_id', $cookie_id)->get();

        $responseData = [];

        foreach ($cartItems as $value) {

            $product = $value->product;
            if (!$product)
                continue; // skip invalid records

            // Base price
            $basePrice = $product->price;

            $productColor = ProductColor::find($value->color_id);
            $productSize = ProductSize::find($value->size_id);

            // === Variant additional price ===
            $variant = ProductVariant::where('product_id', $product->id)
                ->when($value->color_id, fn($q) => $q->where('color_id', $productColor?->color_id ?? null))
                ->when($value->size_id, fn($q) => $q->where('size_id', $productSize?->size_id ?? null))
                ->first();
---
select * from `carts` where `cookie_id` = '1769338841Vj8LxXUE8l' and `carts`.`deleted_at` is null
select * from `colors` where `colors`.`id` in (1)
select * from `product_colors` where `product_colors`.`id` in (100)
select * from `product_sizes` where `product_sizes`.`id` in (273)
select * from `product_colors` where `product_colors`.`id` = '100' limit 1
select * from `product_sizes` where `product_sizes`.`id` = '273' limit 1
select * from `product_variants` where `product_id` = 30 and `color_id` = 1 and `size_id` = 2 limit 1