app/Http/Controllers/CustomerCheckoutController.php

select * from `orders` order by `id` desc limit 1
---
    private function generateOrderNumber()
    {
        $time = time();
        $lastOrder = Order::orderBy('id', 'DESC')->first();

select * from `delivery_zones` where `delivery_zones`.`id` = '3' limit 1
---
    public function CustomerOrderCheckout(Request $request)
    {
        $user = Auth::user();
        if (!$user) {
            return response()->json([
                'status' => false,
                'type' => 'auth',
                'message' => 'User login required'
            ]);
        }

        if ($user->usertype !== 'customer' && $user->usertype !== 'dropshipper') {
            return response()->json([
                'status' => false,
                'type' => 'user_type',
                'message' => $user->usertype . ' cannot place an order!'
            ]);
        }

        // Validate request
        $request->validate([
            'name' => ['required'],
            'email' => ['nullable', 'regex:/^[a-zA-Z0-9._%+-]+@gmail\.com$/'],
            'mobile' => ['required', 'regex:/(^(\+8801|8801|01|008801))[1|5-9]{1}(\d){8}$/'],
            'address' => ['required'],
            'delivery_area' => ['required'],
            'payment_method' => ['required'],
        ]);

        // Get delivery charge
        $deliveryArea = DeliveryZone::find($request->delivery_area);

select * from `carts` where `cookie_id` = '1769340429iPEU3onLPq' and `carts`.`deleted_at` is null
select * from `colors` where `colors`.`id` in (1)
select * from `product_colors` where `product_colors`.`id` in (97, 102)
select * from `product_sizes` where `product_sizes`.`id` in (263, 279)
---
        }

        $cookie_id = $request->cookie('customer_cookie_id');
        $cart_data = Cart::with(['product', 'product_color.color', 'product_size.size', 'product.variants'])->where('cookie_id', $cookie_id)->get();

select * from `product_colors` where `product_colors`.`id` = '97' limit 1
select * from `product_sizes` where `product_sizes`.`id` = '263' limit 1
select * from `product_variants` where `product_id` = 27 and `color_id` = 1 and `size_id` = 1 limit 1
---
            $variantPrice = $product->price; // base price

            if ($cart->color_id || $cart->size_id) {
                $prductColor = ProductColor::find($cart->color_id);
                $productSize = ProductSize::find($cart->size_id);
                $variant = ProductVariant::where('product_id', $product->id)
                    ->when($cart->color_id, fn($q) => $q->where('color_id', $prductColor?->color_id))
                    ->when($cart->size_id, fn($q) => $q->where('size_id', $productSize?->size_id))
                    ->first();

insert into `payments` (`payment_method`, `updated_at`, `created_at`) values ('cod', '2026-01-25 11:34:38', '2026-01-25 11:34:38')
---
            ]);

            // Payment
            $payment = Payment::create(['payment_method' => $request->payment_method]);