app/Http/Controllers/HomeController.php

    public function index()
    {
        $data['orders'] = Order::select('id')->count();
        $data['sellers'] = User::where('usertype','seller')->select('id')->count();
        $data['customers'] = User::where('usertype','customer')->select('id')->count();
        $data['products'] = Product::select('id')->count();
        $data['pending_products'] = Product::where('status', 0)->count();
        $data['pending_order'] = Order::where('status', 'pending')->count();
        $data['confirmed_order'] = Order::where('status','confirmed')->count();
        $data['delivered_order'] = Order::where('status','delivered')->count();
        $data['return_order'] = Order::where('status','return')->count();
        $data['cancel_order'] = Order::where('status','canceled ')->count();
        $data['is_profile_verify'] = User::where('is_profile_verify',1)->count();
        $data['user_total_balance'] = User::sum('balance');
       $data['total_reffer'] = User::whereNotNull('code')->count();
       $data['total_withdraw_request'] = Wallet::count();


         $sellers = User::where('usertype', 'seller')->orderBy('id','DESC');
         $data['paid_sellers']  = $sellers->where('payment_status', 1)->count();
         $sellers = User::where('usertype', 'seller')->orderBy('id','DESC');
         $data['unPaid_sellers']  = $sellers->where('payment_status', 0)->count();
---
select count(*) as aggregate from `orders`
select count(*) as aggregate from `users` where `usertype` = 'customer'
select count(*) as aggregate from `products`
select count(*) as aggregate from `products` where `status` = 0
select count(*) as aggregate from `orders` where `status` = 'confirmed'
select count(*) as aggregate from `orders` where `status` = 'delivered'
select count(*) as aggregate from `orders` where `status` = 'return'
select count(*) as aggregate from `orders` where `status` = 'canceled '
select count(*) as aggregate from `users` where `is_profile_verify` = 1
select sum(`balance`) as aggregate from `users`
select count(*) as aggregate from `users` where `usertype` = 'vendor' and `payment_status` = 1
select count(*) as aggregate from `users` where `usertype` = 'vendor' and `payment_status` = 0