app/Http/Controllers/Backend/DropshipperOrderController.php

    public function pendingDetails($id)
    {
         $data['logo'] = Logo::first();
        $data['order'] = Order::with([
            'order_details',
            'order_details.product',
            'order_details.product_color.color',
            'order_details.product_size.size'
        ])->find($id);
---
select * from `logos` limit 1
select * from `orders` where `orders`.`id` = '14' limit 1