app/Http/Controllers/Backend/DropshipperController.php

select * from `users` where `usertype` = 'dropshipper' order by `id` desc
---
    public function view()
    {
        $pageTitle = 'Dropshipper List';
        $vendors = User::where('usertype', 'dropshipper')->orderBy('id','DESC');
        // if(request()->has('active')){
        //     $pageTitle = 'Active Vendor List';
        //     $vendors = $vendors->where('status', 1);
        // }
        // else if(request()->has('inactive')){
        //     $pageTitle = 'Inactive Vendor List';
        //     $vendors = $vendors->where('status', 0);
        // }
        // else if(request()->has('suspended')){
        //     $pageTitle = 'Suspended Vendor List';
        //     $vendors = $vendors->where('status', 2);
        // }
        // else if(request()->has('paid')){
        //     $pageTitle = 'Paid Vendor List';
        //     $vendors = $vendors->where('payment_status', 1);
        // }
        // else if(request()->has('unpaid')){
        //     $pageTitle = 'Unpaid Vendor List';
        //     $vendors = $vendors->where('payment_status', 0);
        // }


        $vendors = $vendors->get();