app/Http/Controllers/Backend/DropshipperDashboardController.php

    public function dropshipperDashboard()
    {


        $user = Auth::user();
        $dropshipperFees = DropshipperFee::get();
---
select * from `dropshipper_fees`