app/Http/Controllers/Backend/OrderController.php

    public function statusUpdate(Request $request)
    {
        $delivery_status = $request->status;
        $selectedODRs = $request->selectedODRs;

        if ($delivery_status == "" || $selectedODRs == "" || count($selectedODRs) == 0) {
            $res = ['message' => "Select Order Status and Order IDs !!!"];
            return response($res, 203)->header('Content-Type', 'application/json');
        }

        DB::beginTransaction();

        try {
            // multiple order_no হলেও প্রথম টা নিচ্ছে → better loop করা
            $orders = Order::whereIn('order_no', $selectedODRs)->get();

            if ($orders->isEmpty()) {
                DB::rollBack();
                $res = ['message' => "Something wrong !"];
                return response($res, 203)->header('Content-Type', 'application/json');
            }

            foreach ($orders as $order) {
                $order->status = $delivery_status;
                $order->save();
---
select * from `orders` where `order_no` in ('176205927314')
update `orders` set `status` = 'delivered', `orders`.`updated_at` = '2025-11-02 04:58:03' where `id` = '14'

    private function order_amount_distribution(Order $order)
    {
        // order এর details আনো
        $orderDetails = OrderDetail::where('order_id', $order->id)->get();

        foreach ($orderDetails as $detail) {
            if (!empty($detail->reseller_id)) {
                // আসল প্রোডাক্টের default sale_price বের করি
                $product = Product::find($detail->product_id);
                if (!$product)
                    continue;

                // ড্রপশিপারের বিক্রির টোটাল
                $dropshipperTotal = $order->order_total;

                // প্রোডাক্টের default sale price টোটাল
                $defaultTotal = $product->sale_price * $detail->quantity;

                // লাভ হিসাব
                $profit = $dropshipperTotal - $defaultTotal;

                if ($profit > 0) {
                    $dropshipper = User::find($detail->reseller_id);
                    if ($dropshipper) {
                        $dropshipper->increment('balance', $profit);
---
select * from `order_details` where `order_id` = 14
select * from `products` where `products`.`id` = '41' limit 1
select * from `users` where `users`.`id` = '23' limit 1
update `users` set `balance` = `balance` + 50, `users`.`updated_at` = '2025-11-02 04:58:03' where `id` = '23'