app/Http/Controllers/Backend/SellerDashboardController.php

select * from `seller_fees`
---
    public function sellerDashboard()
    {
        $user = Auth::user();

        $sellerfees = SellerFee::get();